{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing two UI theme update tasks with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including theme, pages, components, and config.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark CSS variables for a copper-themed design.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration mapping site routes to their page components.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper with navigation, content outlet, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus and active‑link styling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider managing Internet Identity auth, login flow, and persisted identity state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future backend query hooks.",
  "frontend/src/index.css": "Global Tailwind CSS variables implementing the darker copper palette for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/src/pages/BlankPage.tsx": "Exports a placeholder page that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays themed content cards describing various Brotherhood divisions with images and text.",
  "frontend/src/pages/HistoryPage.tsx": "Defines structured historical lore sections and renders them in styled cards and separators.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero text, navigation buttons, and feature cards linking to other sections.",
  "frontend/src/pages/PhotoPage.tsx": "Shows images and descriptions of T‑10 power armor and its accessories in styled cards.",
  "frontend/src/pages/RanksPage.tsx": "Presents detailed rank hierarchy information using cards and icon‑labeled sections.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "React page rendering styled hero and rank-based armor descriptions using custom UI components and copper-themed visuals.",
  "frontend/tailwind.config.js": "Tailwind config defining theme tokens, extended colors, animations, and plugins including custom copper shadow and OKLCH-based palette.",
  "project_state.json": "JSON metadata capturing project state, existing features, and pending requests related to updating the site's copper color theme."
}