{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file summarizing all frontend source files and their roles in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the copper-themed palette for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with Intro as root route and defines all page routes.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper hiding nav/footer on the intro page and rendering the site shell.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar linking to major routes with active state highlighting.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future React Query hooks.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for colors and styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "A placeholder page that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays themed sections describing Brotherhood divisions with images and styled cards.",
  "frontend/src/pages/HistoryPage.tsx": "Defines and renders multi‑section narrative lore about Texhoma and the Copper Age using styled components.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content and feature cards linking to major site sections.",
  "frontend/src/pages/IntroPage.tsx": "Full‑screen intro with background image and a button that navigates to the home page.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and detailed card featuring T‑10 armor images and accessories.",
  "frontend/src/pages/PosterPage.tsx": "Renders a gallery of poster images inside styled cards with a themed hero section.",
  "frontend/src/pages/RanksPage.tsx": "Renders a detailed ranks hierarchy page with hero section and multiple rank cards and descriptions.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Displays armor and uniform variants by rank with structured sections and styled cards.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, animations, containers, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and pending requests for the intro landing page update."
}