{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Metadata describing two frontend features for adding a Circuit Division section and image asset.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind base styles defining OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders the app within SiteLayout.",
  "frontend/src/components/SiteLayout.tsx": "Provides layout wrapper with nav, outlet, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication context and provider implementation.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future backend query hooks.",
  "frontend/src/index.css": "Tailwind base styles with copper-themed light and dark design tokens.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "Component that renders nothing for placeholder routes.",
  "frontend/src/pages/DivisionsPage.tsx": "Renders the Divisions page with styled sections for Forge and Archive divisions, including images and descriptive text.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero banner and feature cards linking to other site sections like lore, history, ranks, and divisions.",
  "frontend/src/pages/RanksPage.tsx": "Implements the Ranks page with a hero section and detailed card‑based descriptions of leadership and other rank categories.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and utilities for the site's copper-themed design.",
  "project_state.json": "Project state metadata describing implemented features, requirements, and design notes for the Brotherhood of Copper site."
}