{
  "backend/main.mo": "Motoko canister with access control, user profiles, and per-user poster upload limited to two items.",
  "feature_evidence.json": "Feature evidence listing required file changes and components for removing the Posters page and fixing publish failures.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short summaries describing their roles and recent modifications.",
  "frontend/index.css": "Tailwind CSS global styles defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root React application.",
  "frontend/src/App.tsx": "Main React router setup with routes, QueryClient, and Internet Identity provider.",
  "frontend/src/components/NotFound.tsx": "Card-styled 404 page with a link back to Home.",
  "frontend/src/components/SiteLayout.tsx": "Shared layout with optional nav/footer and an Outlet for route rendering.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar listing main site routes without the Posters link.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend canister actor tied to Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and update the caller's user profile via an actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for a copper‑themed UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/BlankPage.tsx": "A placeholder page component that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays themed sections describing organizational divisions with styled cards and images.",
  "frontend/src/pages/HistoryPage.tsx": "Renders multiple lore-heavy history sections using structured cards and formatted text.",
  "frontend/src/pages/HomePage.tsx": "Shows a hero section and feature cards linking to key site areas like ranks, divisions, and history.",
  "frontend/src/pages/IntroPage.tsx": "Intro screen with background art and a button navigating to the home page.",
  "frontend/src/pages/PhotoPage.tsx": "Displays a photo gallery page featuring the T-10 power armor and accessories using cards and images.",
  "frontend/src/pages/PosterPage.tsx": "Empty file with no component implementation.",
  "frontend/src/pages/RanksPage.tsx": "Renders the Brotherhood ranks page with descriptions, icons, and structured card-based hierarchy content.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Shows detailed uniform and armor specifications per rank using cards and list items.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, persisting, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Project state metadata outlining features, issues, and pending requests for removing the Posters page."
}