{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "Feature evidence listing two HistoryPage updates with associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for documentation or build reference.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML scaffold loading the root React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with main site routes and renders the router provider.",
  "frontend/src/components/SiteLayout.tsx": "Page layout component with navigation, outlet region, and footer attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus using TanStack Router links.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider handling Internet Identity authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for potential backend query hooks.",
  "frontend/src/index.css": "Tailwind base styles defining copper-themed OKLCH light and dark palettes.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "Placeholder page component that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays a hero section and detailed cards describing each Brotherhood division with icons, images, and lore text.",
  "frontend/src/pages/HistoryPage.tsx": "Renders a multi-section narrative history using structured data and card-like layout for each story chapter.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero banner, navigation buttons, and feature cards linking to ranks, divisions, and lore.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and a detailed photo card of T-10 power armor with accessory images.",
  "frontend/src/pages/RanksPage.tsx": "Presents the Brotherhood's rank hierarchy with icons and descriptive cards for leadership and other rank groups.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Lists armor and uniform variants by rank using cards and bullet points detailing equipment features.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests for updating the History page."
}