{
  "backend/main.mo": "Empty actor definition with no methods.",
  "feature_evidence.json": "Feature evidence report describing removal of a banner image from HomePage.tsx.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to their descriptions for build reference.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main site pages using SiteLayout.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper providing nav, content outlet, and footer with dynamic year and attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with active link styling and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future backend query hooks.",
  "frontend/src/index.css": "Tailwind base styles defining darker copper/bronze OKLCH theme for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "Intentionally empty page component returning null.",
  "frontend/src/pages/DivisionsPage.tsx": "Renders the Divisions page with hero content and cards describing each Brotherhood division. Includes images and descriptions for Forge and Archive divisions plus others truncated.",
  "frontend/src/pages/HistoryPage.tsx": "Displays multi-section narrative history using cards and structured React content. Contains detailed lore about Texhoma, Colt Mercer, and discoveries beneath the city.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and feature cards linking to ranks, divisions, lore, and history. Emphasizes the Brotherhood theme and navigation.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and a detailed card featuring the T-10 power armor and related accessory images. Focuses on visual presentation of artifacts.",
  "frontend/src/pages/RanksPage.tsx": "Displays detailed rank hierarchy with cards describing leadership and other rank groups. Provides structured lists of responsibilities and traits for each rank.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Shows armor and uniform variants per rank using structured cards. Lists specific equipment details for roles like High Conductor and Conductor.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state metadata tracking versions, existing features, and a pending request to remove the 'Brotherhood of Copper' banner."
}