{
  "backend/main.mo": "Actor managing user profiles and poster uploads with access control, storing per-user blobs and enforcing user/admin permissions.",
  "feature_evidence.json": "Feature evidence report listing implemented photo page enhancements and upload UI features with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend files’ roles, primarily styling, routing, and content pages.",
  "frontend/DEPLOYMENT.md": "Frontend deployment checklist covering build verification, routing, integration, testing, troubleshooting, and rollback steps.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables and dark-mode overrides for the copper design system.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app setup configuring TanStack router (hash-based), React Query, Internet Identity provider, and all route definitions.",
  "frontend/src/components/HiddenYouTubeAudioPlayer.tsx": "Stub component for a hidden YouTube audio player returning null.",
  "frontend/src/components/NotFound.tsx": "Styled 404 page with card layout and link back to Home.",
  "frontend/src/components/PhotoUploadGallery.tsx": "Authenticated photo upload component handling file preview, upload, and display of user poster images.",
  "frontend/src/components/SiteLayout.tsx": "Provides the main app layout with conditional navigation, footer, and routing outlet.",
  "frontend/src/components/SiteNav.tsx": "Renders the site’s responsive navigation bar with active link highlighting and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, updating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/usePosterQueries.ts": "Defines queries and mutations for fetching and uploading poster blobs via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Handles fetching and updating the caller’s user profile using backend actor queries.",
  "frontend/src/index.css": "Defines Tailwind setup and custom light/dark theme variables for the app’s styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/BlankPage.tsx": "A placeholder page that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays a styled page describing various Brotherhood divisions with icons, images, and text.",
  "frontend/src/pages/HistoryPage.tsx": "Renders a multi‑section narrative page detailing Texhoma’s lore and Colt Mercer’s origin using cards and structured story content. Includes static text, icons, and styled sections.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero banner, mission statement, and feature cards linking to ranks, divisions, lore, and history pages.",
  "frontend/src/pages/IntroPage.tsx": "Shows a full‑screen intro with a background image and a button that navigates to the home page.",
  "frontend/src/pages/PhotoPage.tsx": "Presents a photo gallery page featuring images of T‑10 power armor and accessories using cards and custom gallery components.",
  "frontend/src/pages/PosterPage.tsx": "Provides a posters page with a header and a placeholder card indicating the section is under construction.",
  "frontend/src/pages/PropagandaPage.tsx": "Renders a propaganda page with a header and a placeholder card noting the content is under construction.",
  "frontend/src/pages/RanksPage.tsx": "Displays detailed descriptions of Brotherhood ranks using cards and categorized sections with iconography.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Lists uniform and armor variants for each rank with descriptive bullet points inside styled card sections.",
  "frontend/src/types/youtube-iframe.d.ts": "Empty TypeScript declaration file reserved for YouTube iframe typings.",
  "frontend/src/utils/posterImage.ts": "Creates image URLs from ExternalBlob objects with a direct URL fallback and provides helpers for local previews and revoking blob URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the app’s photo-upload features, existing entries, and a pending request for adding the T-0 armor photo and description."
}