{
  "backend/main.mo": "Motoko canister implementing user auth, profile storage, and poster upload/listing with access control and limited poster history.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs for poster upload, display, and image handling features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, mainly UI pages, styles, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH-based theme tokens for light and dark modes with copper‑themed variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, React Query client, and Internet Identity provider with route definitions for all site pages.",
  "frontend/src/components/NotFound.tsx": "NotFound page component rendering a styled card with a link back to Home.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper providing navigation, routed content, and footer, hiding nav/footer on the intro page.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus, copper‑themed styling, and active‑route highlighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/usePosterQueries.ts": "Exposes queries and mutations for fetching and uploading poster blobs through the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for retrieving and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light and dark theme variables for UI colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "A placeholder page component that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Renders a styled page describing organizational divisions with images and themed UI components.",
  "frontend/src/pages/HistoryPage.tsx": "Displays multi‑section narrative lore content about Texhoma and the Copper Age using styled cards and layout.",
  "frontend/src/pages/HomePage.tsx": "Home page presenting a hero section and feature cards linking to major site areas like lore, history, ranks, and divisions.",
  "frontend/src/pages/IntroPage.tsx": "Landing page with a background image and a button that navigates to /home.",
  "frontend/src/pages/PhotoPage.tsx": "Displays a photo gallery section featuring T-10 power armor and accessories with styled cards.",
  "frontend/src/pages/PosterPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/PropagandaPage.tsx": "Manages user profile setup and poster uploading, including preview generation and display of latest poster.",
  "frontend/src/pages/RanksPage.tsx": "Renders detailed rank and hierarchy descriptions for the Brotherhood using styled cards and sections.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Lists armor and uniform variants for ranks with structured card-based descriptions.",
  "frontend/src/utils/posterImage.ts": "Provides utilities to generate image URLs for poster blobs and manage local preview URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending fonts, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata listing existing features, known issues, and requirements for fixing the broken image preview flow."
}