{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence listing two frontend feature updates related to uniform and armor variants and war-era ranks.",
  "frontend-file-summaries.txt": "JSON-like text summarizing various frontend files and their roles in the copper-themed site.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark themes and global styles.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining routes for home, ranks, divisions, lore, and history.",
  "frontend/src/components/SiteLayout.tsx": "Shared layout with navigation, content outlet, and footer.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus using TanStack Router links.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance based on Internet Identity auth state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity auth provider and hook handling login, identity storage, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file for future queries.",
  "frontend/src/index.css": "Copper-themed Tailwind design tokens defining light and dark palettes and global styling.",
  "frontend/src/main.tsx": "React entry point wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "Page component that intentionally renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Page rendering multiple Brotherhood divisions with icons, images, and descriptive text using Card components.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards linking to major site sections like ranks and divisions.",
  "frontend/src/pages/RanksPage.tsx": "Page displaying detailed rank hierarchy with structured sections and cards for each rank category.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Page outlining armor and uniform variants per rank using cards and bullet lists.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state, architectural notes, requirements, and implemented features."
}