{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing two HistoryPage.tsx update features and associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend files.",
  "frontend/index.css": "Tailwind base layer defining light and dark theme CSS variables for layout and components.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all site pages within the SiteLayout root.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper with navigation, content outlet, and footer attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus and active-link styling.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing backend actor instances tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider handling Internet Identity login, storage, and status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder export for backend query hooks.",
  "frontend/src/index.css": "Tailwind base layer with copper‑themed light and dark color systems and shared styles.",
  "frontend/src/main.tsx": "App bootstrap mounting React, QueryClient, InternetIdentityProvider, and styles.",
  "frontend/src/pages/BlankPage.tsx": "Intentionally empty page component that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Renders a hero section and detailed cards describing each Brotherhood division with images and text. Focuses on Forge and Archive divisions in the provided portion.",
  "frontend/src/pages/HistoryPage.tsx": "Defines a structured set of historical lore sections and renders them as cards with narrative-rich content. Uses a list of predefined sections describing Texhoma, Colt Mercer, and discoveries beneath the city.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero section and feature cards linking to major site areas like ranks, divisions, and lore. Provides introductory text and navigation buttons.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and a card featuring an image of the T-10 power armor along with accessory images. Focuses on presenting Brotherhood-related visual artifacts.",
  "frontend/src/pages/RanksPage.tsx": "Renders hierarchical rank descriptions with detailed lists for leadership roles. Uses cards to outline responsibilities and symbolism for each rank.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Presents armor and uniform specifications per rank using cards and bullet lists. Includes detailed visual and descriptive elements for different hierarchical levels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing update requirements for the History page with new Texhoma (2105) Copper Age narrative and related features."
}