{
  "backend/main.mo": "Motoko canister with access control, user profile storage, and per-user poster upload/retrieval using blob storage.",
  "feature_evidence.json": "Feature report describing poster upload UI changes and fallback image behavior with associated files and components.",
  "frontend-file-summaries.txt": "Reference file listing short summaries of various frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind base style definitions and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app setup including TanStack Router routes, React Query client, and Internet Identity wrapper.",
  "frontend/src/components/SiteLayout.tsx": "Layout component providing navigation, routed content outlet, and footer except on intro page.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus, routing links, and active-state styling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state using AuthClient, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and poster blobs via an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlankPage.tsx": "Renders an empty placeholder page.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays themed content and images describing different Brotherhood divisions.",
  "frontend/src/pages/HistoryPage.tsx": "Shows multi‑section narrative lore about the origins and events of the Copper Age.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, navigation buttons, and feature cards for main site areas.",
  "frontend/src/pages/IntroPage.tsx": "Full‑screen intro page with background image and a button navigating to the home page.",
  "frontend/src/pages/PhotoPage.tsx": "Displays a photo showcase page featuring the T-10 power armor and related accessories using cards and images.",
  "frontend/src/pages/PosterPage.tsx": "Provides a poster upload interface with authentication, profile setup, file validation, previewing, and upload progress handling.",
  "frontend/src/pages/RanksPage.tsx": "Renders detailed descriptions of Brotherhood ranks with styled sections and icon-enhanced cards.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Lists armor and uniform specifications for each rank through structured card components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, plugins, and design tokens for the project.",
  "project_state.json": "Defines the project’s current state, including existing and requested features for adding photo upload and backend storage for poster images. Contains metadata, feature lists, and pending requests."
}