{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence describing adding carry-2.png to PosterPage and its related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files providing an overview of structure, routing, and themed UI pages.",
  "frontend/index.css": "Tailwind base style overrides defining a light/dark OKLCH color system with copper-themed variables.",
  "frontend/index.html": "HTML entry point defining root container and loading the main React module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and renders the router provider.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper with navigation, page outlet, and footer, hiding nav/footer on the intro page.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus and active‑route highlighting.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context provider and hook handling auth client creation, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for query hooks.",
  "frontend/src/index.css": "Tailwind base theme with updated darker copper/bronze OKLCH variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up QueryClient, and wraps the app with identity/auth providers.",
  "frontend/src/pages/BlankPage.tsx": "Intentional placeholder page that renders nothing.",
  "frontend/src/pages/DivisionsPage.tsx": "Displays detailed cards describing the Brotherhood’s divisions with images and themed lore text.",
  "frontend/src/pages/HistoryPage.tsx": "Defines a structured set of lore-based history sections for Texhoma and the Copper Age, rendered with cards and formatted content.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero banner and feature cards linking to major site sections like ranks, lore, and divisions.",
  "frontend/src/pages/IntroPage.tsx": "Intro splash screen with a background image and a button that navigates to the home page.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and a card displaying images of T-10 power armor and accessories.",
  "frontend/src/pages/PosterPage.tsx": "Renders a simple poster showcase with a hero header and a single recruitment-style image.",
  "frontend/src/pages/RanksPage.tsx": "Renders hierarchical rank information for the Brotherhood using themed cards and structured sections.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "React page rendering styled sections describing armor and uniform variants by rank using cards, icons, and Tailwind styling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and shadows, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata file tracking project state, features, and pending requests for a project showing an uploaded image on the Posters page."
}