{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Report describing a feature request to add a 14px disclaimer to HomePage.tsx with associated metadata.",
  "frontend-file-summaries.txt": "List of prewritten summaries for various frontend files detailing layout, design, and page content.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH design tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all pages wrapped in SiteLayout.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper providing navigation, content outlet, and footer with attribution.",
  "frontend/src/components/SiteNav.tsx": "Responsive navigation bar with desktop and mobile menus and active route styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, storage, and status management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future query hooks.",
  "frontend/src/index.css": "Tailwind global styles defining copper-themed color tokens for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with QueryClientProvider and InternetIdentityProvider, and loads styles.",
  "frontend/src/pages/BlankPage.tsx": "Empty placeholder page component returning null.",
  "frontend/src/pages/DivisionsPage.tsx": "Renders a hero section and multiple division cards describing the Brotherhood’s specialized branches with images and text. Primarily static content with styled cards for each division.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a hero header and narrative history cards detailing the origins of the Copper Age and key early events. Content is fully static and storytelling-focused.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage hero section and feature cards linking to other site sections like lore, ranks, and divisions. Emphasizes navigation and visual presentation.",
  "frontend/src/pages/PhotoPage.tsx": "Shows a hero section and a detailed photo card featuring the T-10 power armor and its accessories. Contains static imagery and descriptive labels.",
  "frontend/src/pages/RanksPage.tsx": "Renders structured rank descriptions with styled cards and sections outlining hierarchy, responsibilities, and divisions. Entirely static hierarchical content.",
  "frontend/src/pages/UniformArmorVariantsByRankPage.tsx": "Presents armor and uniform variants per rank using structured cards and lists. Focuses on static descriptive details of equipment by rank.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, keyframes, animations, and custom themes with plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, required page/content updates, and architectural notes for expanding the Brotherhood of Copper site with new sections and layout changes."
}