{
  "kind": "build_request",
  "title": "Add Circuit Division section and image to Divisions page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Add a new division section to the Divisions page for \"Circuit Division\" with the subtitle text \"(Engineers, Energy Techs, Comms)\", styled consistently with the existing Forge/Archive/Field division cards and without changing the shared SiteLayout (navigation/footer) or existing division sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add to division  Circuit Division (Engineers, Energy Techs, Comms)"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /divisions shows an additional card/section titled \"Circuit Division\".",
        "The new section displays the subtitle text exactly as: \"(Engineers, Energy Techs, Comms)\".",
        "The new section uses the same Card-based styling patterns as the other division sections (consistent spacing, typography, borders/shadows).",
        "Existing Forge, Archive, and Field sections remain present and unchanged in content and order unless necessary to append the new section.",
        "The global header navigation and footer (SiteLayout) are not modified."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add the user-uploaded image file \"circuitdivison.png\" to the frontend as a static asset and render it within the new Circuit Division section on the Divisions page using the same image treatment (size, border, rounding, shadow) as the other division images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The user has uploaded 1 image(s): circuitdivison.png."
        ]
      },
      "acceptanceCriteria": [
        "The file \"circuitdivison.png\" is available as a static asset in the frontend and can be loaded by the app at runtime.",
        "The Circuit Division section renders an <img> using the circuit image and an appropriate alt text (e.g., \"Circuit Division\").",
        "The circuit image is styled consistently with the existing division images (e.g., max width, rounded corners, border, copper shadow)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI components); compose them as-is.",
    "Preserve the existing shared SiteLayout behavior and appearance (top navigation and footer).",
    "Keep the existing division sections (Forge, Archive, Field) intact; only add the new Circuit Division section."
  ],
  "nonGoals": [
    "No backend/Motoko changes.",
    "No new routes or navigation changes.",
    "No requirement to add additional page content beyond the new Circuit Division section and its image."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}