{
  "kind": "build_request",
  "title": "Update History page with Texhoma (2105) Copper Age narrative",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update `frontend/src/pages/HistoryPage.tsx` to replace the existing eight History sections (I–VIII) with the user-provided Texhoma/Colt Mercer (2105) narrative, keeping the same overall page structure (hero, table of contents, and section cards) and using English for all user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "update history page with following information   I. Texhoma: The City Split by a Line (2105) ... VIII. The Final Moment of 2105 — The Copper Sky ..."
        ]
      },
      "acceptanceCriteria": [
        "The History page displays exactly eight sections labeled I–VIII with titles matching the user-provided headings: (I) \"Texhoma: The City Split by a Line (2105)\", (II) \"Colt Mercer — The One the Grid Recognizes\", (III) \"The Revelation Beneath Texhoma\", (IV) \"The First Followers — The Texhoma Seekers\", (V) \"The First Armor: T‑1 Copper Frame\", (VI) \"The First Enemy — The Iron Reclaimers\", (VII) \"The Founding of the Brotherhood of Copper (Late 2105)\", (VIII) \"The Final Moment of 2105 — The Copper Sky\".",
        "Each section’s body text matches the user-provided narrative content, including the quoted line: “The Order will rise again when the world is ready to be rebuilt.” and the list of tenets under section VII.",
        "The Table of Contents renders all eight updated section titles and clicking each entry smoothly scrolls to the correct section card on both desktop and mobile.",
        "Direct navigation via URL hash (e.g., loading the page with `#section-v`) scrolls to the correct section as it does currently.",
        "No changes are made to any read-only paths listed in `frontend.immutablePaths`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the History page hero heading/subheading in `frontend/src/pages/HistoryPage.tsx` so the top-of-page introduction aligns with the new Texhoma-focused 2105 narrative (while remaining consistent with the current layout and styling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I. Texhoma: The City Split by a Line (2105)"
        ]
      },
      "acceptanceCriteria": [
        "The hero title/subtitle are updated to reflect the Texhoma (2105) storyline (English text) and the hero section remains visually consistent with the existing design (icon, spacing, gradient background)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui/*`.",
    "Keep the existing in-page navigation behavior (TOC anchor click + hashchange scrolling) intact while updating content."
  ],
  "nonGoals": [
    "No backend/canister changes (Motoko) are required for this content update.",
    "No new routes or pages are required.",
    "No authentication or data persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}