{
  "kind": "build_request",
  "title": "Add T-0 Junkyard-built Power Armor photo + description to Photos page and enable uploads",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Add a new entry on the existing Photos page (/photo) for the “T-0 Junkyard-built Power Armor” that displays the user-provided image file (\"junkyard power armor t-2.png\") and a well-written English description paragraph (or short multi-paragraph description) of the armor, matching the existing copper-themed Card layout used for the T-10 entry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "upload photo to photos page write the decription of the T-0 Junkyard built Power armor"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /photo shows a clearly labeled “T-0 Junkyard-built Power Armor” section/card.",
        "The image \"junkyard power armor t-2.png\" is displayed in that section and renders correctly in production build.",
        "The section includes an English description of the T-0 Junkyard-built Power Armor (not placeholder text) with readable typography consistent with the page."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement an image upload UI on the Photos page that lets an authenticated user select an image file, preview it locally, upload it to the existing backend blob upload API, and then display the uploaded image(s) on the Photos page.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "upload photo to photos page"
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, the Photos page does not attempt to fetch private blobs; it shows a clear sign-in requirement/state instead of failing silently.",
        "When authenticated, the user can choose an image file and see a local preview before uploading.",
        "Clicking Upload successfully calls the backend upload API and, on success, the uploaded image appears in the Photos page list/gallery without requiring a hard refresh.",
        "Upload errors (e.g., unauthorized, actor not available) are surfaced to the user in a readable way.",
        "The Photos page continues to show the existing T-10 content and styling; new upload UI and gallery do not break the layout on mobile and desktop."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths; compose existing UI components instead.",
    "Do not introduce external databases or third-party auth; use existing Internet Identity and the current blob storage patterns."
  ],
  "nonGoals": [
    "Fixing or diagnosing deployment errors unrelated to the Photos page changes.",
    "Creating new routes/pages beyond updating the existing /photo page.",
    "Adding non-image media types (video/audio) upload support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}