{
  "kind": "build_request",
  "title": "Add uploaded banner to Home Page hero section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the uploaded image file `brotherhood of copper banner.png` as a visible banner on the Home Page (`frontend/src/pages/HomePage.tsx`), placed within the existing hero section so it appears above the hero title and scales responsively across mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add banner to Home Page"
        ]
      },
      "acceptanceCriteria": [
        "The Home Page hero section renders the uploaded banner image above the \"Brotherhood of Copper\" heading.",
        "The banner is responsive (maintains aspect ratio, does not overflow horizontally, and looks acceptable on mobile and desktop).",
        "The image includes appropriate accessibility attributes (e.g., meaningful alt text) and does not cause layout shift (reserve height via CSS/aspect styling)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the uploaded banner image to the frontend as a static asset (do not serve it via the backend) and reference it from the Home Page using a stable path under `frontend/public/assets/generated/`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add banner to Home Page"
        ]
      },
      "acceptanceCriteria": [
        "`brotherhood of copper banner.png` is available at runtime as a static file under `frontend/public/assets/generated/` (or an equivalent public static asset path) and is referenced directly by the Home Page.",
        "No backend (Motoko) changes are required to display the banner."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify any files in `frontend/src/hooks/` listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Creating or modifying backend canister logic (Motoko).",
    "Adding new routes or navigation items unrelated to the Home Page banner."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}