{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Posters page and stabilize frontend publish/redeploy",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Completely remove the Posters page by deleting its implementation, unregistering the `/posters` route, and removing all navigation links to it so the frontend builds cleanly.",
      "acceptanceCriteria": [
        "The app no longer registers a route at `/posters` (attempting to navigate to `/posters` does not render the Posters page).",
        "The primary site navigation no longer includes a 'Posters' link in either desktop or mobile menus.",
        "The frontend builds successfully with no unused-import/module-not-found errors related to the removed Posters page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the Posters page import and remove the `/posters` route from the TanStack Router route tree so it is no longer registered."
        },
        {
          "path": "frontend/src/components/SiteNav.tsx",
          "operation": "modify",
          "description": "Remove the 'Posters' item from the navLinks array so both desktop and mobile menus no longer link to `/posters`."
        },
        {
          "path": "frontend/src/pages/PosterPage.tsx",
          "operation": "delete",
          "description": "Delete the Posters page implementation so it is no longer part of the frontend build."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove poster-related React Query hooks (e.g., fetching/uploading posters) and any related imports/types so no orphaned code or unused imports remain after removing the Posters page."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Resolve the publish/republish failure by ensuring the frontend build is robust after page removal and unknown routes are handled safely in production deployments.",
      "acceptanceCriteria": [
        "A publish/redeploy run completes successfully without showing the error message 'AI was unable to complete your request'.",
        "The deployed application loads and routes work as expected after publishing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NotFound.tsx",
          "operation": "create",
          "description": "Add a simple Not Found screen component to render for unknown routes, preventing runtime failures when users navigate to removed paths (including the former `/posters` path)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the NotFound component into the router/root route configuration as the not-found handler so navigating to removed/unknown routes does not break the app and publishing/deploying remains stable."
        }
      ]
    }
  ]
}