{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update History page with Texhoma (2105) Copper Age narrative",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the eight History sections (I–VIII) with the user-provided Texhoma/Colt Mercer (2105) narrative while preserving existing hero/TOC/section-card structure and hash/scroll behavior.",
      "acceptanceCriteria": [
        "The History page displays exactly eight sections labeled I–VIII with titles matching the user-provided headings: (I) \"Texhoma: The City Split by a Line (2105)\", (II) \"Colt Mercer — The One the Grid Recognizes\", (III) \"The Revelation Beneath Texhoma\", (IV) \"The First Followers — The Texhoma Seekers\", (V) \"The First Armor: T‑1 Copper Frame\", (VI) \"The First Enemy — The Iron Reclaimers\", (VII) \"The Founding of the Brotherhood of Copper (Late 2105)\", (VIII) \"The Final Moment of 2105 — The Copper Sky\".",
        "Each section’s body text matches the user-provided narrative content, including the quoted line: “The Order will rise again when the world is ready to be rebuilt.” and the list of tenets under section VII.",
        "The Table of Contents renders all eight updated section titles and clicking each entry smoothly scrolls to the correct section card on both desktop and mobile.",
        "Direct navigation via URL hash (e.g., loading the page with `#section-v`) scrolls to the correct section as it does currently.",
        "No changes are made to any read-only paths listed in `frontend.immutablePaths`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Update the `historySections` data to use the user-provided Texhoma/Colt Mercer (2105) narrative: set section titles to exactly match the provided I–VIII headings; replace each section body with the provided English narrative text (including the exact quoted line “The Order will rise again when the world is ready to be rebuilt.” and the section VII tenets list); keep the existing section ids (`section-i` ... `section-viii`) and preserve the current TOC mapping and hash/scroll behavior (TOC click smooth-scroll + URL hash update, plus initial-load/hashchange scrolling)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the History page hero heading/subheading to align with the Texhoma-focused 2105 narrative while keeping the existing hero styling and layout.",
      "acceptanceCriteria": [
        "The hero title/subtitle are updated to reflect the Texhoma (2105) storyline (English text) and the hero section remains visually consistent with the existing design (icon, spacing, gradient background)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Revise the hero section title and subtitle text to introduce the Texhoma (2105) storyline in English while keeping the current hero structure and styling intact (Zap icon, spacing, and gradient background unchanged)."
        }
      ]
    }
  ]
}