{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update global theme tokens to a darker copper palette",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Darken the global copper palette by updating CSS variable theme tokens in frontend/src/index.css for both light (:root) and dark (.dark) themes so all Tailwind color utilities shift consistently across the app.",
      "acceptanceCriteria": [
        "Across all pages (Home, Ranks, Divisions, Uniform & Armor Variants, History, Photo), copper accents (primary/accent/secondary) appear noticeably darker than before and remain consistent between pages.",
        "Light theme and dark theme both preserve readable contrast for primary buttons/links and primary-foreground text (no low-contrast copper-on-copper).",
        "No page-specific color overrides are required to achieve the darker copper update; the change is driven by the global theme variables in `frontend/src/index.css`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the copper-related OKLCH CSS variables for :root and .dark (e.g., --primary/--primary-foreground, --secondary/--secondary-foreground, --accent/--accent-foreground, --border, --input, --ring, plus any muted/accent background tokens that create copper tint) to a darker copper palette while preserving contrast. This ensures shadcn-ui and Tailwind utilities (bg-primary, text-primary, border/ring, gradients, muted/accent backgrounds) update globally without per-page edits. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Align Tailwind theme extensions that hardcode copper values (e.g., shadow-copper) with the new darker copper palette to avoid mismatched copper tones.",
      "acceptanceCriteria": [
        "Elements using `shadow-copper` (e.g., hero icons and featured cards) render with the updated darker copper tint, consistent with the new primary copper color.",
        "No remaining hardcoded old copper values cause mismatched copper tones versus the updated CSS variable-based palette."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update any hardcoded copper-related theme extensions (including the current boxShadow.copper OKLCH value) to match the new darker copper palette, and audit the Tailwind config for other literal copper values that should be derived from CSS variables or updated to the new palette. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}