{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refactor and add in-page navigation to History page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refactor the eight History narrative sections into a single structured in-file data array and render the section cards by mapping over the data without changing any visible story text.",
      "acceptanceCriteria": [
        "HistoryPage renders the same hero title/subtitle and the same eight sections (I–VIII) with the same visible wording as before.",
        "The eight sections are defined in a single in-file data structure (e.g., an array of objects) and rendered via iteration (no repeated copy/paste Card blocks).",
        "No console errors/warnings are introduced when visiting /history."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Replace the repeated Section I–VIII Card JSX blocks with a single in-file data structure (array of section objects including numeral, title, stable anchor id, and content as React nodes) and render cards via iteration. Keep the hero title/subtitle and all visible story wording identical to the current page. Use existing shadcn-ui Card primitives (Card, CardHeader, CardTitle, CardContent) for layout and consistency; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a table of contents near the top of the History page that links to anchored IDs for each section (I–VIII) and works on desktop and mobile, including direct URL fragments.",
      "acceptanceCriteria": [
        "A table of contents is visible on the History page and lists links for sections I through VIII using the section titles.",
        "Clicking a table-of-contents link scrolls to the corresponding section card on the same page.",
        "Each section card has a stable `id`/anchor target so direct URL fragments (e.g., `/history#section-iii`) scroll to the correct section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Add an in-page Table of Contents block near the top of the main content that maps over the same sections data to render anchor links to each section’s stable id (e.g., section-i ... section-viii). Ensure each rendered section card is wrapped or decorated with the matching id and appropriate scroll offset handling for the sticky SiteNav (e.g., scroll margin utilities). Add lightweight hash-fragment handling on initial render so visiting /history#section-iii scrolls reliably on both desktop and mobile. Use existing shadcn-ui Card and Separator components to present the TOC and visually separate it from the narrative sections; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}