{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Photos page: add T-0 Junkyard-built Power Armor card and authenticated image uploads",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a new copper-themed Card on /photo for “T-0 Junkyard-built Power Armor” that shows the provided image and a real English description, matching the existing T-10 layout styling.",
      "acceptanceCriteria": [
        "Navigating to /photo shows a clearly labeled “T-0 Junkyard-built Power Armor” section/card.",
        "The image \"junkyard power armor t-2.png\" is displayed in that section and renders correctly in production build.",
        "The section includes an English description of the T-0 Junkyard-built Power Armor (not placeholder text) with readable typography consistent with the page."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/junkyard power armor t-2.png",
          "operation": "create",
          "description": "Add the user-provided image asset so it can be referenced on the Photos page and reliably served in production builds."
        },
        {
          "path": "frontend/src/pages/PhotoPage.tsx",
          "operation": "modify",
          "description": "Add a new copper-themed Card below/near the existing T-10 section for “T-0 Junkyard-built Power Armor”, rendering the static image from frontend/public/assets/junkyard power armor t-2.png and a polished English description with typography consistent with the existing Card layout. Verify the component's usage instructions before implementing (shadcn-ui Card)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "On /photo, add an authenticated image upload UI with local preview and upload-to-backend flow, then display uploaded images in a gallery without refresh and with clear auth/error states.",
      "acceptanceCriteria": [
        "When not authenticated, the Photos page does not attempt to fetch private blobs; it shows a clear sign-in requirement/state instead of failing silently.",
        "When authenticated, the user can choose an image file and see a local preview before uploading.",
        "Clicking Upload successfully calls the backend upload API and, on success, the uploaded image appears in the Photos page list/gallery without requiring a hard refresh.",
        "Upload errors (e.g., unauthorized, actor not available) are surfaced to the user in a readable way.",
        "The Photos page continues to show the existing T-10 content and styling; new upload UI and gallery do not break the layout on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhotoUploadGallery.tsx",
          "operation": "create",
          "description": "Create a Photos-page-only component that: (1) uses the authorization component capability (useInternetIdentity) to detect authentication and provide a sign-in/sign-out action, (2) uses the blob-storage component capability (ExternalBlob + getDirectURL/getBytes) to render uploaded images, and (3) provides file selection, local preview, upload progress/state, and readable error messages. Verify the component's usage instructions before implementing (authorization, blob-storage, shadcn-ui Button/Input/Card)."
        },
        {
          "path": "frontend/src/pages/PhotoPage.tsx",
          "operation": "modify",
          "description": "Wire the upload/gallery UI into the existing /photo page without adding new routes: render an authenticated-only upload panel and a gallery section; render a clear sign-in required state when unauthenticated; ensure existing T-10 and new T-0 cards remain intact and the layout stays responsive. Verify the component's usage instructions before implementing (authorization for auth state; blob-storage for displaying uploaded images; shadcn-ui components for consistent styling)."
        },
        {
          "path": "frontend/src/hooks/usePosterQueries.ts",
          "operation": "modify",
          "description": "Adjust poster query/mutation behavior as needed for the Photos page upload flow: ensure queries are disabled when unauthenticated (no private blob fetch attempts), propagate upload errors cleanly, and keep query invalidation so newly uploaded images appear without a hard refresh. Verify the component's usage instructions before implementing (authorization for auth gating; blob-storage ExternalBlob upload patterns)."
        },
        {
          "path": "frontend/src/utils/posterImage.ts",
          "operation": "modify",
          "description": "Extend image URL utilities as needed for the Photos gallery: support local preview URL lifecycle cleanup and robustly derive display URLs for ExternalBlob instances (prefer direct URL, fallback to bytes) with predictable error propagation for UI surfacing. Verify the component's usage instructions before implementing (blob-storage ExternalBlob getDirectURL/getBytes)."
        }
      ]
    }
  ]
}