{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Circuit Division card + static image on Divisions page",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add a new Circuit Division section to the Divisions page, matching existing division card styling and preserving SiteLayout and existing sections.",
      "acceptanceCriteria": [
        "Visiting /divisions shows an additional card/section titled \"Circuit Division\".",
        "The new section displays the subtitle text exactly as: \"(Engineers, Energy Techs, Comms)\".",
        "The new section uses the same Card-based styling patterns as the other division sections (consistent spacing, typography, borders/shadows).",
        "Existing Forge, Archive, and Field sections remain present and unchanged in content and order unless necessary to append the new section.",
        "The global header navigation and footer (SiteLayout) are not modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DivisionsPage.tsx",
          "operation": "modify",
          "description": "Append a new \"Circuit Division\" Card section to the existing DivisionsPage content (after the current sections), using the existing shadcn/ui Card components for consistent layout and styling. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add circuitdivison.png as a frontend static asset and render it inside the new Circuit Division section with consistent image styling.",
      "acceptanceCriteria": [
        "The file \"circuitdivison.png\" is available as a static asset in the frontend and can be loaded by the app at runtime.",
        "The Circuit Division section renders an <img> using the circuit image and an appropriate alt text (e.g., \"Circuit Division\").",
        "The circuit image is styled consistently with the existing division images (e.g., max width, rounded corners, border, copper shadow)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/circuitdivison.png",
          "operation": "create",
          "description": "Add the uploaded static asset \"circuitdivison.png\" to the public assets folder so it can be loaded at runtime."
        },
        {
          "path": "frontend/src/pages/DivisionsPage.tsx",
          "operation": "modify",
          "description": "Render the Circuit Division image within the new Circuit Division Card using the same image treatment as existing division images (e.g., max width, rounded corners, border, shadow) and set alt text to \"Circuit Division\"."
        }
      ]
    }
  ]
}