{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add II–III content to Uniform & Armor Variants by Rank page",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add section II (Uniform & Armor Variants by Rank) with rank-ordered bullet lists to the Uniform & Armor Variants by Rank page.",
      "acceptanceCriteria": [
        "The Uniform & Armor Variants by Rank page includes a visible heading \"II. Uniform & Armor Variants by Rank\".",
        "The section renders all listed ranks in the specified order, each with the exact bullet items provided (including punctuation and terms like \"T-10A\", \"T-1\", \"T-3\").",
        "All user-facing text on this page is in English.",
        "Styling is consistent with the existing copper-themed design (e.g., similar typography, spacing, card/section treatments) and remains readable on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UniformArmorVariantsByRankPage.tsx",
          "operation": "create",
          "description": "Create (or replace, if missing) the \"Uniform & Armor Variants by Rank\" page view and implement the new \"II. Uniform & Armor Variants by Rank\" section, rendering the ranks in the required order with the exact provided bullet text. Use shadcn/ui components (e.g., Card, Separator) to match existing copper-themed layout patterns; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the UniformArmorVariantsByRankPage into the existing router so it is navigable via an existing route (preferably the current /lore placeholder route) without changing SiteLayout behavior."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add section III (Copper War–Era Rank Structure) with intro sentence and New / Temporary Ranks subsection and bullet lists to the same page.",
      "acceptanceCriteria": [
        "The page includes a visible heading \"III. Copper War–Era Rank Structure\".",
        "The sentence \"During the Copper War, the Brotherhood becomes more militarized, more desperate, and more mythic.\" is rendered as body text under the III heading.",
        "A visible \"New / Temporary Ranks\" subheading is rendered, followed by the five ranks in the specified order with their exact bullet items (including \"T-10B\" and quotation marks around “Breaker”).",
        "The new section matches the site’s existing layout patterns (container width, spacing, card/section styling) without changing the shared SiteLayout navigation or footer behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UniformArmorVariantsByRankPage.tsx",
          "operation": "modify",
          "description": "Extend the Uniform & Armor Variants by Rank page to include the new \"III. Copper War–Era Rank Structure\" section, including the exact intro sentence and the \"New / Temporary Ranks\" subsection with ranks in the required order and exact bullet text. Use existing shadcn/ui components (e.g., Card, Separator) and the existing copper-themed typography/spacing patterns; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}